Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ ཤེས་རབ་ བརྩེགས་ ནི་ རྔོན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བྷར་ ག་ རྡོ་རྗེ་ ཡི །_། ལམ་སྲང་ དག་ ནི་ མཚོན་པ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $541 “The well-gone Prajñākūṭa, when a hunter, |#| Showed the way |#| To the thus-gone Bhargavajra |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ལེགས་ གནས་ བྲམ་ཟེ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ དབྱངས་ དེ་ ལ །_། བཻ་ དཱུརྱ་ ལས་ བྱས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $542 “The thus-gone Susthita, when a brahmin, |#| Offered a beryl parasol |#| To the thus-gone Lion Melody |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བློ་ སྦྱངས་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྐར་མ འི་ སྐབས་ དེ་ ལ །_། སྣ་མ འི་ མེ་ཏོག་ བདུན་ ཞིག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $543 “The thus-gone Cīrṇabuddhi, when a garland maker, |#| Offered seven sumanā flowers |#| To the thus-gone Star Opportunity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚངས་དབྱངས་ ལམ་ སྟོན་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དེད་དཔོན་ དེ་ ལ་ ནི །_། གསེར་ གྱི་ མེ་ཏོག་ དག་ ནི་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $544 “The well-gone Brahmaghoṣa, when a young guide, |#| Scattered golden flowers |#| Before the thus-gone Captain |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ མཆོག་ ནི་ ཞིང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མི་ ཡི་ ཟླ་བ་ ལ །_། བལ་ སྲན་ སྔོན་པོ་ སྤར་གང་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $545 “The well-gone Guṇottama, when a farmer, |#| Scattered a handful of blue beans |#| Before the thus-gone Moon of Humanity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འབྲུག་སྒྲ་ དབྱངས་ ནི་ རྩིས་པ་ ཡི །_། ཁྱེའུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ བཀོད་ ཆེན་ ལ །_། ཕྲེང་བ འི་ ཆུན་པོ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $546 “The well-gone Garjitasvara, when a young astrologer, |#| Offered flower garlands |#| To the thus-gone Great Array |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མངོན་ཤེས་ ཏོག་ ནི་ རིགས་ གཙོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཉི་མ འི་ འོད་ དེ་ ལ །_། དར་ དང་ བདུག་པ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $547 “The well-gone Abhijñāketu, when the head of a great family, |#| Offered silk and incense |#| To the thus-gone Sunlight |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཏོག་ འོད་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཛེས་ དང་ ལྡན་པ་ དེ འི །_། ཞབས་ གཉིས་ དག་ ནི་ བཀྲུ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $548 “The thus-gone Ketuprabha, when a prince, |#| Washed both feet |#| Of the thus-gone Endowed with Beauty |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དགེ་བ་ ཁྱིམ་བདག་ ཚེ །_། བདེ་གཤེགས་ སྲིད་མཐའ་ ནོར་བུ འི་ སྤོས་ དེ་ ལ །_། དགུན་སྨད་ སྦྱར་ ཐུག་ དག་ ནི་ གསོལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $549 “The thus-gone Kṣema, when a householder, |#| Offered pulse stew for the winter |#| To the well-gone Jewel Fragrance of the End of Existence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚངས་པ་ མཐིང་ [315a] བུ་ འཚོང་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཞི་བ ར་ གནས་ དེ་ |#| ལ །_། མཐིང་ བུ འི་ ནོར་བུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $550 “The well-gone Brahmā, when a merchant of deep blue stones, [315.a] |#| Offered precious deep blue stones |#| To the thus-gone Abiding in Peace |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྐྱེས་མཆོག་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ་ བསྡུས་ དེ་ ལ །_། གུར་ཀུམ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $551 “The well-gone Puṃgava, when the son of a merchant, |#| Offered saffron |#| To the thus-gone Gathering of Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤྱན་ སྡུག་ སྤོས་ འཚོང་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཚངས་པ ས་ མཆོད་ དེ་ |#| ལ །_། སྤོས་ ཀྱི་ ཕྱེ་མ་ སྤར་གང་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $552 “The well-gone Laḍitanetra, when a young incense merchant, |#| Scattered a handful of fragrant powder |#| Before the thus-gone Worshiped by Brahmā |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཀླུ ས་ སྦྱིན་ རྫ་མཁན་ ཆུང་མ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ང་རོ་ ཆེན་པོ་ ལ །_། ཆུ་ ཡིས་ བཀང་བ འི་ སྣོད་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $553 “The well-gone Nāgadatta, when the wife of a potter, |#| Offered vessels filled with water |#| To the thus-gone Great Roar |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བདེན་ ཏོག་ ཚོང་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ་ དགྱེས་ དེ་ ལ །_། གསེར་ གྱི་ ཁྲི་སྟན་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $554 “The thus-gone Satyaketu, when a merchant, |#| Offered golden thrones |#| To the thus-gone Joyful Fame |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བརྒྱན་པ་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཁས་པ་ གསལ་ དེ་ ལ །_། སྤོས་ ཀྱི་ ཕུར་མ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $555 “The thus-gone Maṇḍita, when an incense merchant, |#| Offered balls of incense |#| To the thus-gone Clear Learning |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཞུམ་ མེད་ དབྱངས་ ནི་ ལྕགས་མགར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྨོན་ལམ་ མཐའ་ ཡས་ལ །_། ལྕགས་ ལས་ བྱས་པ འི་ སྣོད་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $556 “The well-gone Adīnaghoṣa, when a blacksmith, |#| Offered iron vessels |#| To the thus-gone Infinite Aspiration |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ འོད་ ནི་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འགྲོ་བ འི་ འོད་ཟེར་ ལ །_། སྤོས་ ཀྱི་ རྡོ་གུ་ དག་ གིས་ བདུགས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $557 “The well-gone Ratnaprabha, when a captain, |#| Burned fragrant pellets |#| Before the thus-gone Radiance of the World |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དབྱངས་ ནི་ བྱིན་པ་ ཡིས །_། དེ་བཞིན་ གཤེགས་པ་ ལྟ་ ན་ བཟོད་ དེ་ ལ །_། དཔྱིད་ཀ་ ཆབ་རོམ་ གོང་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $558 “The thus-gone Ghoṣadatta, |#| Offered a lump of ice in the spring |#| To the thus-gone Acceptance upon Sight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ་ དག་ ནི་ མགར་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ ཆེན་པོ་ ལ །_། དེ་ ལ་ ཁབ་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $559 “The well-gone Siṃha, when a blacksmith, |#| Offered needles |#| To the thus-gone Great Flower |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ཟེར་ སྣ་ཚོགས་ ཤ་ན་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསྒོམས་པ འི་ བདག་ཉིད་ དེ་ ལ་ ནི །_། ཤ་ན་ དག་ ལས་ བྱས་པ འི་ ན་བཟའ་ ཕུལ་ [315b] ནས་ ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $560 “The well-gone Citraraśmi, when a flax maker, |#| Offered linen robes |#| To the thus-gone Being of Meditation [315.b] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡེ་ཤེས་ དཔའ་བོ་ གྲོང་རྡལ་ གྱི །_། ཁྱེའུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ བློ་གསལ་ ལ །_། ལ་དུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $561 “The well-gone Jñānaśūra, when a village boy, |#| Offered laḍḍu |#| To the thus-gone Clear Mind |#| And in doing so first gave rise to the mind of awakening.

source: !བདེ་གཤེགས་ པད་མ འི་ སྙིང་པོ་ རྩིས་པ་ ཡི །_། ཁྱེའུ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ མཁས་ བློ་ ལ །_། མེ་ཏོག་ སྙིམ་པ་ བཀང་ སྟེ་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $562 “The well-gone Padmaskandha, when a young astrologer, |#| Scattered handfuls of flowers |#| Before the thus-gone Expert Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མེ་ཏོག་ རྒྱས་པ་ ལག་ བླ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ནོར་སྦྱིན་ དེ་ ལ་ ནི །_། དུས་ མ་ཡིན་པ ར་ བཅུད་ལྡན་ བཏུང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $563 “The well-gone Puṣpita, when a supervisor of a new building,#212 |#| Offered juice out of season |#| To the thus-gone Gift of Jewels |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཐུ་རྩལ་ སྟབས་ ནི་ རལ་པ་ ཅན །_། སྦྱིན་སྲེག་ མཁན་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། ཞུམ་ མེད་ དབྱངས་ ལ་ ཞུགས་ལིང་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $564 “The well-gone Vikrāntagamin, when a dreadlocked ascetic performing fire sacrifices, |#| Offered a fire pot |#| To the thus-gone Undaunted Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསོད་ནམས་ ཕུང་པོ་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ དུ་ གཟིགས་ དེ་ |#| ལ །_། ལྷུང་བཟེད་ སྦྲང་རྩི ས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $565 “The well-gone Puṇyarāśi, when a merchant, |#| Offered an alms bowl filled with honey |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟུགས་མཆོག་ གྲོང་ཁྱེར་ སྲུང་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ བཟང་པོ་ ལ །_། བཏུང་བ་ བྱིན་ གྱིས་ བརླབས་པ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $566 “The well-gone Śreṣṭharūpa, when a city guard, |#| Offered a consecrated drink |#| To the thus-gone Excellent Moon |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྐར་ མཁན་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ངེས་པ འི་ གཟུགས་ དེ་ ལ །_། སྤོས་ ཀྱི་ རྒྱུ་དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $567 “The thus-gone Jyotiṣka, when an incense merchant, |#| Offered incense substances |#| To the thus-gone Certain Form |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཟླ་བ འི་ སྒྲོན་མ་ སློངས་ མོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྣལ་འབྱོར་ སེམས་དཔའ་ ལ །_། འགྲོན་བུ་ ཉི་ཤུ་ དག་ ནི་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $568 “The well-gone Candrapradīpa, when a female beggar, |#| Scattered twenty cowries |#| Before the thus-gone Being of Spiritual Training |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་བརྗིད་ ཕུང་པོ་ རྩྭ་ ཐུན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟབ་མོ ར་ གནས་ དེ་ |#| ལ །_། རྩྭ་ ལས་ བྱས་པ འི་ གདུགས་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $569 “The well-gone Tejorāśi, when a straw collector, |#| Offered a straw parasol |#| To the thus-gone Profound Abiding |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བྱང་ཆུབ་ རྒྱལ་པོ་ ཤིང་རྟ་ ཡི །_། མཁན་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ དཔལ་ འོད་ ལ །_། ཤིང་རྟ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $570 “The well-gone Bodhirāja, when a chariot maker, |#| Offered chariots |#| To the thus-gone Glorious Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མི་ཟད་ ཤིང་རྟ་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རབ་ཏུ་ གདུལ་ དཀའ་ [316a] ལ །_། བཞུགས་ ཁྲིའུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $571 “The well-gone Akṣaya, when a chariot maker, |#| Offered thrones [316.a] |#| To the thus-gone Very Hard to Tame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མངོན་རྟོགས་ སྤྱན་ ནི་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ དུ་ གཟིགས་ དེ་ |#| ལ །_། བལྡག་ སྨན་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $572 “The well-gone Subuddhinetra, when a physician, |#| Offered medicinal lozenges |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡན་ལག་ རྒྱས་པ་ ཕྱུགས་རྫི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ སྒྲོན་ དེ་ ལ །_། ལྷུང་བཟེད་ དར་བ ས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $573 “The well-gone Pūritāṅga, when a cattle herder, |#| Offered an alms bowl filled with buttermilk |#| To the thus-gone Moon Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡུལ་འཁོར་ ཤེས་རབ་ མར་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསལ་བ འི་ དཔལ་ དེ་ ལ །_། ཞུན་མ ར་ སྲང་ བརྒྱད་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $574 “The well-gone Prajñārāṣṭra, when a butter merchant, |#| Offered eight measures of clarified butter |#| To the thus-gone Glory of Clarity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མཆོག་ ནི་ བོང་ རྫི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ གདུགས་ དེ་ ལ །_། བཞུགས་པ འི་ རྡོ་ གདན་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $575 “The thus-gone Uttama, when a donkey herder, |#| Offered a stone seat |#| To the thus-gone Moon Parasol |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཟི་བརྗིད་ ཚིམ་ མཛད་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འགྲོ་བ འི་ མུ་སྟེགས་ ལ །_། སེའུ་ འབྲུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $576 “The well-gone Toṣitatejas, when a prince, |#| Offered pomegranates |#| To the thus-gone Steps for Wandering Beings |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤེས་རབ་ བྱིན་ ནི་ མར་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསལ་བ འི་ དཔལ་ དེ་ ལ །_། མར་ཁུ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $577 “The well-gone Prajñādatta, when a butter merchant, |#| Offered clarified butter |#| To the thus-gone Glory of Clarity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ འཇམ་དབྱངས་ རྫ་མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཆོག་ དེ་ ལ །_། རིལ་བ་ ཆུ་ ཡིས་ བཀང་ སྟེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $578 “The thus-gone Mañjughoṣa, when a potter, |#| Offered a jar filled with water |#| To the thus-gone Supreme Jewel |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མགོན་པོ་ རིགས་ བུ འི་ ཚེ །_། བདེ་གཤེགས་ བཟང་པོ་ ངོ་ཚ་ མཁྱེན་པ་ ལ །_། འཆག་ས་ དག་ ནི་ བྱས་ ཏེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $579 “The thus-gone Nātha, when a young family man, |#| Made and offered a monastic walkway |#| Before the well-gone Excellent Knower of Modesty |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆགས་ མེད་ མཛོད་ ནི་ མི་ བཀྲེན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བལྟ་བ ར་ བཟོད་ དེ་ |#| ལ །_། ཚོད་མ འི་ ཀོང་བུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $580 “The well-gone Asaṅgakośa, when a destitute, |#| Offered a basket of vegetables |#| To the thus-gone Bearing Seeing |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཙོ་བོ ས་ བྱིན་ ནི་ ལྷ་ ཡི་ བུ །_། དབང་ཕྱུག་ ཆེ་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་པོ །_། སེང་གེ འི་ ང་རོ་ དེ་ ལ་ བསྟོད་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $581 “The well-gone Jyeṣṭhadatta, when a divine son of great power, |#| Offered praises |#| To the thus-gone Lion’s Roar |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཙོ་བོ་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐུ་རྩལ་ ཆེན་པོ་ ལ །_། [316b] སྤོས་ ལོ འི་ རིལ་བུ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $582 “The thus-gone Śreṣṭha, when an incense merchant, |#| Offered balls made of fragrant leaves |#| To the thus-gone Great Power[316.b] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡེ་ཤེས་ མཐུ་རྩལ་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གསལ་ དེ་ |#| ལ །_། ཀོ་ བི་ ད་ར འི་ མེ་ཏོག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $583 “The well-gone Jñānavikrama, when a forest guard, |#| Offered kovidāra flowers |#| To the thus-gone Universal Clarity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ འོད་འཕྲོ་ དགེ་སློང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་ ཀྱི་ སྣོད་ དེ་ ལ །_། བུ་རམ་ ཆུ་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $584 “The thus-gone Arciṣmat, when a monk, |#| Offered sugarcane juice |#| To the thus-gone Melody Vessel |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དབང་པོ་ ཁྱིམ་བདག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དགའ་བ འི་ དཔལ་ དེ་ ལ །_། སྐྱེད་མོས་ཚལ་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $585 “The thus-gone Indra, when a householder, |#| Offered pleasure gardens |#| To the thus-gone Glory of Joy |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤུགས་ འཆང་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཉམ་པ ར་ གནས་པ་པོ །_། དེ་ ལ་ གདུགས་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $586 “The well-gone Vegadhārin, when the son of a merchant, |#| Offered parasols |#| To the thus-gone Abiding in Equanimity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྐར་རྒྱལ་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ ཚེ །_། བདེ་གཤེགས་ ཀུན་ གྱི་ བློ་ དེ་ འཁོར་བཅས་ ཐེར་འབུམ་ དག _། |#| དབྱར་གནས་ ཚེ་ ན་ ཕོངས་པ་ མེད་པ ས་ སྤྱན་ དྲངས་ ནས །_། |#| དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $587 “The thus-gone Tiṣya, when a universal monarch, |#| Invited the well-gone Universal Mind and his billionfold retinue |#| For the rains retreat without sparing anything, |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ འོད་ བཟང་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐུ་རྩལ་ ཆེན་པོ་ ལ །_། སྦྲང་རྩི་ ཅི་ བཞེད་པ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $588 “The thus-gone Suprabha, when a merchant, |#| Offered as much honey as would be accepted |#| To the thus-gone Great Power |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་ བྱིན་ འཛམ་གླིང་ རྒྱལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ ཏོག་ དེ་ ཡི །_། གཙུག་ལག་ཁང་ ནི་ བྱེ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $589 “The well-gone Yaśodatta, when a king of Jambudvīpa, |#| Constructed ten million monastic temples |#| Before the thus-gone Moon Crest |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཟུགས་བཟང་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྟུལ་ཞུགས་ བརྟན་ དེ་ ལ །_། སྤོས་ ནི་ སྲང་ གི་ བཞི་ཆ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $590 “The thus-gone Surūpa, when an incense merchant, |#| Offered four measures of incense |#| To the thus-gone Steadfast Yogic Discipline |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ རྒྱལ་པོ་ གསེར་ རྟོག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལྷ་ ཡིས་ མཆོད་ དེ་ ལ །_། ཁྲོན་པ་ ཟླུམ་པོ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $591 “The thus-gone Rājan, when a gold dealer,#213 |#| Offered a round well |#| To the thus-gone Worshiped by Gods |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དོན་གྲུབ་ བྲམ་ཟེ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཐལ་བ ར་ རློག་ དེ་ ལ །_། མཆོད་སྦྱིན་ ཆེན་པོ་ དག་ ནི་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $592 “The thus-gone Arthasiddhi, when a brahmin, |#| Performed great sacrificial worship |#| For the thus-gone Pulverizing |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ སྡེ་ ནི་ དབང་བློན་ གྱི །_། བུ་ ཚེ་ དེ་བཞིན་ གཤེགས་ [317a] པ་ གྲགས་ མཆོག་ ལ །_། སྐྱེད་མོས་ཚལ་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $593 “The well-gone Siṃhasena, when the son of a judge, |#| Offered pleasure gardens [317.a] |#| To the thus-gone Supreme Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ནོར་ལྷ འི་ བུ་ ནི་ ཚོང་དཔོན་ བུ་མོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཐམས་ཅད་ རྫོགས་པ་པོ །_། དེ་ ལ་ ཞབས་ བཀྲུ་བ་ དག་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $594 “The well-gone Vāsava, when the daughter of a merchant, |#| Offered a footbath |#| To the thus-gone Perfecter of All Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་པ་ རྒྱལ་པོ འི་ བཙུན་མོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་ བརྟན་ དེ་ |#| ལ་ ནི །_། རང་ གི་ རྒྱན་ རྣམས་ དག་ གིས་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $595 “The well-gone Yaśas, when a queen, |#| Scattered her own ornaments |#| Before the thus-gone Stable Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱལ་བ་ རྒྱལ་པོ འི་ བུ་མོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ འོད་ཟེར་ ཅན །_། དེ་ ལ་ཐོད་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $596 “The well-gone Jaya, when a princess, |#| Offered her crown |#| To the thus-gone Nectar Radiance |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱ་ ཆེན་ སྙིང་པོ་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་ ཆེན་ དེ་ ལ་ ནི །_། མུ་ཏིག་ དག་ ལས་ བྱས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $597 “The well-gone Udāragarbha, when a merchant, |#| Offered a parasol made of pearls |#| To the thus-gone Great Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསོད་ནམས་ འོད་ཟེར་ ལྕགས་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་གསལ་ དེ་ ལ་ ནི །_། སོག་མ་ དག་ ལས་ བྱས་པ འི་ ཕྲེང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $598 “The well-gone Puṇyaraśmi, when a guard of an ironworks,#214 |#| Offered a garland of straw |#| To the thus-gone Clear Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྨྲང་འདོན་ འབྲུ་མར་ མཁན་ གྱི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟོབས་ཆེན་ དེ་ ལ་ ནི །_། ལྷུང་བཟེད་ འབྲུ་མར་ དག་ གིས་ བཀང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $599 “The well-gone Śrotriya, when an oil producer, |#| Offered an alms bowl filled with oil |#| To the thus-gone Great Strength |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྒྲོན་ རྒྱལ་ རྩིས་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐུ་རྩལ་ ཆེན་པོ་ ལ །_། མེ་ཏོག་ འབྲས་བུ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $600 “The well-gone Pradīparāja, when the son of an astrologer, |#| Offered flowers and fruits |#| To the thus-gone Great Power |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡེ་ཤེས་ བརྩེགས་ ནི་ ལྗོངས་ དག་ གི །_། ཕོ་ཉ་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས་པ་པོ །_། བདུད་རྩི་ གསལ་ ལ་ སྦྲང་རྩི འི་ བཏུང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $601 “The well-gone Jñānakūṭa, when a head messenger of a province, |#| Offered a honey drink |#| To the thus-gone Luminous Nectar |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ལྷ་ མཆོག་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བྱང་ཆུབ་ མཐུ་རྩལ་ ལ །_། མ་ ཏུ་ ལུང་ ག་དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $602 “The thus-gone Uttamadeva, when a forest guard, |#| Offered a medicine of lime |#| To the thus-gone Power of Awakening |#| And in doing so first gave rise to the mind of awakening.
